results/M1.5_0.00000000000/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          300;
        startFace       119500;
    }
    sym
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          120;
        startFace       119800;
    }
    wedge
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       119920;
    }
    top
    {
        type            patch;
        nFaces          200;
        startFace       120000;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          60000;
        startFace       120200;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          60000;
        startFace       180200;
    }
    outlet
    {
        type            patch;
        nFaces          300;
        startFace       240200;
    }
)

// ************************************************************************* //
